Австралия/src/DataProcessors/InfobaseObjectMapping/InfobaseObjectMapping.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>InfobaseObjectMapping</name>
  <attributes>
    <name>DataImportedSuccessfully</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationTableName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceTableObjectTypeName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeMessageFileName</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationTableSearchFields</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationTableFields</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>UsedFieldsList</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>TableFieldsList</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceTypeString</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>DestinationTypeString</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>InfobaseNode</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>IsObjectDeletion</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>UnapprovedMappingTable</name>
    <attributes>
      <name>DestinationUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SourceUUID</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DestinationType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AutomaticallyMappedObjectsTable</name>
    <attributes>
      <name>Check</name>
      <comment>&quot;Yes&quot; to apply mapping. Otherwise, &quot;No.&quot;</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SourceUUID</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DestinationType</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField3</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField4</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationField5</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField3</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField4</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>SourceField5</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>DestinationPictureIndex</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SourcePictureIndex</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SortTable</name>
    <attributes>
      <name>FieldName</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Use</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>SortDirection</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Австралия/src/DataProcessors/InfobaseObjectMapping/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// For internal use.
//
Procedure MapObjects(Parameters, TempStorageAddress) Export
	
	PutToTempStorage(ObjectMappingResult(Parameters), TempStorageAddress);
	
EndProcedure

// For internal use.
//
Procedure ExecuteAutomaticObjectMapping(Parameters, TempStorageAddress) Export
	
	PutToTempStorage(AutomaticObjectMappingResult(Parameters), TempStorageAddress);
	
EndProcedure

#EndRegion

#Region Private
// For internal use.
//
Function ObjectMappingResult(Parameters)
	
	ObjectMapping = Create();
	DataExchangeServer.ImportObjectContext(Parameters.ObjectContext, ObjectMapping);
	
	Cancel = False;
	
	// Applying the table of unapproved mapping items to the database.
	If Parameters.FormAttributes.UnapprovedRecordTableApplyOnly Then
		
		ObjectMapping.ApplyUnapprovedRecordsTable(Cancel);
		
		If Cancel Then
			Raise NStr("ru = 'Возникли ошибки в процессе сопоставления объектов.'; en = 'Errors occurred during object mapping.'; pl = 'Wystąpiły błędy podczas mapowania obiektów.';es_ES = 'Errores ocurridos al mapear los objetos.';es_CO = 'Errores ocurridos al mapear los objetos.';tr = 'Nesneler eşleştirilirken hatalar oluştu.';it = 'Errori registrati durante la mappatura oggetti.';de = 'Beim Mapping von Objekten sind Fehler aufgetreten.'");
		EndIf;
		
		Return Undefined;
	EndIf;
	
	// Applying automatic object mapping result obtained by the user.
	If Parameters.FormAttributes.ApplyAutomaticMappingResult Then
		
		// Adding rows to the table of unapproved mapping items
		For Each TableRow In Parameters.AutomaticallyMappedObjectsTable Do
			
			FillPropertyValues(ObjectMapping.UnapprovedMappingTable.Add(), TableRow);
			
		EndDo;
		
	EndIf;
	
	// Applying the table of unapproved mapping items to the database.
	If Parameters.FormAttributes.ApplyUnapprovedRecordsTable Then
		
		ObjectMapping.ApplyUnapprovedRecordsTable(Cancel);
		
		If Cancel Then
			Raise NStr("ru = 'Возникли ошибки в процессе сопоставления объектов.'; en = 'Errors occurred during object mapping.'; pl = 'Wystąpiły błędy podczas mapowania obiektów.';es_ES = 'Errores ocurridos al mapear los objetos.';es_CO = 'Errores ocurridos al mapear los objetos.';tr = 'Nesneler eşleştirilirken hatalar oluştu.';it = 'Errori registrati durante la mappatura oggetti.';de = 'Beim Mapping von Objekten sind Fehler aufgetreten.'");
		EndIf;
		
	EndIf;
	
	// Generating mapping table.
	ObjectMapping.MapObjects(Cancel);
	
	If Cancel Then
		Raise NStr("ru = 'Возникли ошибки в процессе сопоставления объектов.'; en = 'Errors occurred during object mapping.'; pl = 'Wystąpiły błędy podczas mapowania obiektów.';es_ES = 'Errores ocurridos al mapear los objetos.';es_CO = 'Errores ocurridos al mapear los objetos.';tr = 'Nesneler eşleştirilirken hatalar oluştu.';it = 'Errori registrati durante la mappatura oggetti.';de = 'Beim Mapping von Objekten sind Fehler aufgetreten.'");
	EndIf;
	
	Result = New Structure;
	Result.Insert("ObjectCountInSource",       ObjectMapping.ObjectCountInSource());
	Result.Insert("ObjectCountInDestination",       ObjectMapping.ObjectCountInDestination());
	Result.Insert("MappedObjectCount",   ObjectMapping.MappedObjectCount());
	Result.Insert("UnmappedObjectCount", ObjectMapping.UnmappedObjectCount());
	Result.Insert("MappedObjectPercentage",       ObjectMapping.MappedObjectPercentage());
	Result.Insert("MappingTable",               ObjectMapping.MappingTable());
	
	Result.Insert("ObjectContext", DataExchangeServer.GetObjectContext(ObjectMapping));
	
	Return Result;
EndFunction

// For internal use.
//
Function AutomaticObjectMappingResult(Parameters)
	
	ObjectMapping = Create();
	DataExchangeServer.ImportObjectContext(Parameters.ObjectContext, ObjectMapping);
	
	// Defining the UsedFieldList property.
	ObjectMapping.UsedFieldsList.Clear();
	CommonClientServer.FillPropertyCollection(Parameters.FormAttributes.UsedFieldsList, ObjectMapping.UsedFieldsList);
	
	// Defining the TableFieldList property
	ObjectMapping.TableFieldsList.Clear();
	CommonClientServer.FillPropertyCollection(Parameters.FormAttributes.TableFieldsList, ObjectMapping.TableFieldsList);
	
	// Loading the table of unapproved mapping items
	ObjectMapping.UnapprovedMappingTable.Load(Parameters.UnapprovedMappingTable);
	
	Cancel = False;
	
	// Receiving the automatic object mapping table.
	ObjectMapping.ExecuteAutomaticObjectMapping(Cancel, Parameters.FormAttributes.MappingFieldsList);
	
	If Cancel Then
		Raise NStr("ru = 'Возникли ошибки в процессе автоматического сопоставления объектов.'; en = 'Errors occurred during automatic object mapping.'; pl = 'Wystąpiły błędy podczas automatycznego mapowania obiektów.';es_ES = 'Errores ocurridos al mapear los objetos automáticamente.';es_CO = 'Errores ocurridos al mapear los objetos automáticamente.';tr = 'Nesneler otomatik olarak eşleştirilirken hatalar oluştu.';it = 'Errori registrati durante la mappatura oggetti automatica.';de = 'Beim automatischen Mapping von Objekten sind Fehler aufgetreten.'");
	EndIf;
	
	Result = New Structure;
	Result.Insert("EmptyResult", ObjectMapping.AutomaticallyMappedObjectsTable.Count() = 0);
	Result.Insert("ObjectContext", DataExchangeServer.GetObjectContext(ObjectMapping));
	
	Return Result;
EndFunction

#EndRegion

#EndIf
